{"backend": "tensorflow", "config": [{"config": {"name": "conv2d_1", "activity_regularizer": null, "filters": 32, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "relu", "kernel_regularizer": null, "dilation_rate": [1, 1], "data_format": "channels_first", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "use_bias": true, "batch_input_shape": [null, 1, 28, 28], "kernel_size": [5, 5], "dtype": "float32", "bias_constraint": null, "padding": "valid"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_first", "trainable": true, "padding": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "relu", "name": "dense_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 10, "kernel_regularizer": null, "activation": "softmax", "name": "dense_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "keras_version": "2.1.6", "class_name": "Sequential"}