{"keras_version": "2.1.6", "config": [{"config": {"filters": 5, "batch_input_shape": [null, 1, 28, 28], "use_bias": true, "padding": "valid", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "data_format": "channels_first", "activity_regularizer": null, "strides": [1, 1], "kernel_size": [5, 5], "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "kernel_constraint": null, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 10, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "softmax", "kernel_constraint": null, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}